rafaelmartins/cmake-stm32g4-cmsis/example/main.c
/*
 * SPDX-FileCopyrightText: 2023-2024 Rafael G. Martins <rafael@rafaelmartins.eng.br>
 * SPDX-License-Identifier: BSD-3-Clause
 */

// Blinks the user LED in NUCLEO-G431KB @ 0.5Hz

#include <stm32g4xx.h>

#define clock_frequency 170000000


void
SysTick_Handler(void)
{
    static int counter = 0;
    if ((++counter % 1000) == 0)
        GPIOB->BSRR = (GPIOB->ODR & GPIO_ODR_OD8_Msk) ? GPIO_BSRR_BR8 : GPIO_BSRR_BS8;
}


void
clock_init(void)
{
    FLASH->ACR &= ~FLASH_ACR_LATENCY;
    FLASH->ACR |= FLASH_ACR_LATENCY_4WS;
    while ((FLASH->ACR & FLASH_ACR_LATENCY) != FLASH_ACR_LATENCY_4WS);

    PWR->CR5 &= ~PWR_CR5_R1MODE;

#ifndef USE_HSI
    RCC->CR |= RCC_CR_HSEON;
    while ((RCC->CR & RCC_CR_HSERDY) != RCC_CR_HSERDY);
#else
    RCC->CR |= RCC_CR_HSION;
    while ((RCC->CR & RCC_CR_HSIRDY) != RCC_CR_HSIRDY);
#endif

    RCC->PLLCFGR &= ~(RCC_PLLCFGR_PLLSRC | RCC_PLLCFGR_PLLM | RCC_PLLCFGR_PLLN | RCC_PLLCFGR_PLLR);
    RCC->PLLCFGR |= (85 << RCC_PLLCFGR_PLLN_Pos) | (0 << RCC_PLLCFGR_PLLR_Pos |
#ifndef USE_HSI
        RCC_PLLCFGR_PLLSRC_HSE | RCC_PLLCFGR_PLLM_2 | RCC_PLLCFGR_PLLM_0);
#else
        RCC_PLLCFGR_PLLSRC_HSI | RCC_PLLCFGR_PLLM_1 | RCC_PLLCFGR_PLLM_0);
#endif
    RCC->PLLCFGR |= RCC_PLLCFGR_PLLREN;
    RCC->CR |= RCC_CR_PLLON;
    while ((RCC->CR & RCC_CR_PLLRDY) != RCC_CR_PLLRDY);

    RCC->CFGR &= ~(RCC_CFGR_SW | RCC_CFGR_HPRE);
    RCC->CFGR |= RCC_CFGR_SW_PLL | RCC_CFGR_HPRE_DIV2;
    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL);
    for (__IO uint32_t i = clock_frequency / 2000000; i; i--);
    RCC->CFGR &= ~(RCC_CFGR_HPRE | RCC_CFGR_PPRE1 | RCC_CFGR_PPRE2);
    RCC->CFGR |= RCC_CFGR_HPRE_DIV1 | RCC_CFGR_PPRE1_DIV1 | RCC_CFGR_PPRE2_DIV1;

    SysTick_Config(clock_frequency / 1000);
    SystemCoreClock = clock_frequency;
}


int
main(void)
{
    clock_init();

    RCC->AHB2ENR |= RCC_AHB2ENR_GPIOBEN;
    __asm volatile ("nop");
    __asm volatile ("nop");

    GPIOB->MODER &= ~GPIO_MODER_MODE8;
    GPIOB->MODER |= GPIO_MODER_MODE8_0;

    while (1);

    return 0;
}
